export const regions = [{
		id: 110000,
		pid: 0,
		name: "北京",
		code: "110000"
	},
	{
		id: 110101,
		pid: 110000,
		name: "东城",
		code: "110101"
	},
	{
		id: 110102,
		pid: 110000,
		name: "西城",
		code: "110102"
	},
	{
		id: 110105,
		pid: 110000,
		name: "朝阳",
		code: "110105"
	},
	{
		id: 110106,
		pid: 110000,
		name: "丰台",
		code: "110106"
	},
	{
		id: 110107,
		pid: 110000,
		name: "石景山",
		code: "110107"
	},
	{
		id: 110108,
		pid: 110000,
		name: "海淀",
		code: "110108"
	},
	{
		id: 110109,
		pid: 110000,
		name: "门头沟",
		code: "110109"
	},
	{
		id: 110111,
		pid: 110000,
		name: "房山",
		code: "110111"
	},
	{
		id: 110112,
		pid: 110000,
		name: "通州",
		code: "110112"
	},
	{
		id: 110113,
		pid: 110000,
		name: "顺义",
		code: "110113"
	},
	{
		id: 110114,
		pid: 110000,
		name: "昌平",
		code: "110114"
	},
	{
		id: 110115,
		pid: 110000,
		name: "大兴",
		code: "110115"
	},
	{
		id: 110116,
		pid: 110000,
		name: "怀柔",
		code: "110116"
	},
	{
		id: 110117,
		pid: 110000,
		name: "平谷",
		code: "110117"
	},
	{
		id: 110118,
		pid: 110000,
		name: "密云",
		code: "110118"
	},
	{
		id: 110119,
		pid: 110000,
		name: "延庆",
		code: "110119"
	},
	{
		id: 120000,
		pid: 0,
		name: "天津",
		code: "120000"
	},
	{
		id: 120101,
		pid: 120000,
		name: "和平",
		code: "120101"
	},
	{
		id: 120102,
		pid: 120000,
		name: "河东",
		code: "120102"
	},
	{
		id: 120103,
		pid: 120000,
		name: "河西",
		code: "120103"
	},
	{
		id: 120104,
		pid: 120000,
		name: "南开",
		code: "120104"
	},
	{
		id: 120105,
		pid: 120000,
		name: "河北",
		code: "120105"
	},
	{
		id: 120106,
		pid: 120000,
		name: "红桥",
		code: "120106"
	},
	{
		id: 120110,
		pid: 120000,
		name: "东丽",
		code: "120110"
	},
	{
		id: 120111,
		pid: 120000,
		name: "西青",
		code: "120111"
	},
	{
		id: 120112,
		pid: 120000,
		name: "津南",
		code: "120112"
	},
	{
		id: 120113,
		pid: 120000,
		name: "北辰",
		code: "120113"
	},
	{
		id: 120114,
		pid: 120000,
		name: "武清",
		code: "120114"
	},
	{
		id: 120115,
		pid: 120000,
		name: "宝坻",
		code: "120115"
	},
	{
		id: 120116,
		pid: 120000,
		name: "滨海",
		code: "120116"
	},
	{
		id: 120117,
		pid: 120000,
		name: "宁河",
		code: "120117"
	},
	{
		id: 120118,
		pid: 120000,
		name: "静海",
		code: "120118"
	},
	{
		id: 120119,
		pid: 120000,
		name: "蓟州",
		code: "120119"
	},
	{
		id: 130000,
		pid: 0,
		name: "河北",
		code: "130000"
	},
	{
		id: 130100,
		pid: 130000,
		name: "石家庄",
		code: "130100"
	},
	{
		id: 130200,
		pid: 130000,
		name: "唐山",
		code: "130200"
	},
	{
		id: 130300,
		pid: 130000,
		name: "秦皇岛",
		code: "130300"
	},
	{
		id: 130400,
		pid: 130000,
		name: "邯郸",
		code: "130400"
	},
	{
		id: 130500,
		pid: 130000,
		name: "邢台",
		code: "130500"
	},
	{
		id: 130600,
		pid: 130000,
		name: "保定",
		code: "130600"
	},
	{
		id: 130700,
		pid: 130000,
		name: "张家口",
		code: "130700"
	},
	{
		id: 130800,
		pid: 130000,
		name: "承德",
		code: "130800"
	},
	{
		id: 130900,
		pid: 130000,
		name: "沧州",
		code: "130900"
	},
	{
		id: 131000,
		pid: 130000,
		name: "廊坊",
		code: "131000"
	},
	{
		id: 131100,
		pid: 130000,
		name: "衡水",
		code: "131100"
	},
	{
		id: 140000,
		pid: 0,
		name: "山西",
		code: "140000"
	},
	{
		id: 140100,
		pid: 140000,
		name: "太原",
		code: "140100"
	},
	{
		id: 140200,
		pid: 140000,
		name: "大同",
		code: "140200"
	},
	{
		id: 140300,
		pid: 140000,
		name: "阳泉",
		code: "140300"
	},
	{
		id: 140400,
		pid: 140000,
		name: "长治",
		code: "140400"
	},
	{
		id: 140500,
		pid: 140000,
		name: "晋城",
		code: "140500"
	},
	{
		id: 140600,
		pid: 140000,
		name: "朔州",
		code: "140600"
	},
	{
		id: 140700,
		pid: 140000,
		name: "晋中",
		code: "140700"
	},
	{
		id: 140800,
		pid: 140000,
		name: "运城",
		code: "140800"
	},
	{
		id: 140900,
		pid: 140000,
		name: "忻州",
		code: "140900"
	},
	{
		id: 141000,
		pid: 140000,
		name: "临汾",
		code: "141000"
	},
	{
		id: 141100,
		pid: 140000,
		name: "吕梁",
		code: "141100"
	},
	{
		id: 150000,
		pid: 0,
		name: "内蒙古",
		code: "150000"
	},
	{
		id: 150100,
		pid: 150000,
		name: "呼和浩特",
		code: "150100"
	},
	{
		id: 150200,
		pid: 150000,
		name: "包头",
		code: "150200"
	},
	{
		id: 150300,
		pid: 150000,
		name: "乌海",
		code: "150300"
	},
	{
		id: 150400,
		pid: 150000,
		name: "赤峰",
		code: "150400"
	},
	{
		id: 150500,
		pid: 150000,
		name: "通辽",
		code: "150500"
	},
	{
		id: 150600,
		pid: 150000,
		name: "鄂尔多斯",
		code: "150600"
	},
	{
		id: 150700,
		pid: 150000,
		name: "呼伦贝尔",
		code: "150700"
	},
	{
		id: 150800,
		pid: 150000,
		name: "巴彦淖尔",
		code: "150800"
	},
	{
		id: 150900,
		pid: 150000,
		name: "乌兰察布",
		code: "150900"
	},
	{
		id: 152200,
		pid: 150000,
		name: "兴安盟",
		code: "152200"
	},
	{
		id: 152500,
		pid: 150000,
		name: "锡林郭勒",
		code: "152500"
	},
	{
		id: 152900,
		pid: 150000,
		name: "阿拉善",
		code: "152900"
	},
	{
		id: 210000,
		pid: 0,
		name: "辽宁",
		code: "210000"
	},
	{
		id: 210100,
		pid: 210000,
		name: "沈阳",
		code: "210100"
	},
	{
		id: 210200,
		pid: 210000,
		name: "大连",
		code: "210200"
	},
	{
		id: 210300,
		pid: 210000,
		name: "鞍山",
		code: "210300"
	},
	{
		id: 210400,
		pid: 210000,
		name: "抚顺",
		code: "210400"
	},
	{
		id: 210500,
		pid: 210000,
		name: "本溪",
		code: "210500"
	},
	{
		id: 210600,
		pid: 210000,
		name: "丹东",
		code: "210600"
	},
	{
		id: 210700,
		pid: 210000,
		name: "锦州",
		code: "210700"
	},
	{
		id: 210800,
		pid: 210000,
		name: "营口",
		code: "210800"
	},
	{
		id: 210900,
		pid: 210000,
		name: "阜新",
		code: "210900"
	},
	{
		id: 211000,
		pid: 210000,
		name: "辽阳",
		code: "211000"
	},
	{
		id: 211100,
		pid: 210000,
		name: "盘锦",
		code: "211100"
	},
	{
		id: 211200,
		pid: 210000,
		name: "铁岭",
		code: "211200"
	},
	{
		id: 211300,
		pid: 210000,
		name: "朝阳",
		code: "211300"
	},
	{
		id: 211400,
		pid: 210000,
		name: "葫芦岛",
		code: "211400"
	},
	{
		id: 220000,
		pid: 0,
		name: "吉林",
		code: "220000"
	},
	{
		id: 220100,
		pid: 220000,
		name: "长春",
		code: "220100"
	},
	{
		id: 220200,
		pid: 220000,
		name: "吉林",
		code: "220200"
	},
	{
		id: 220300,
		pid: 220000,
		name: "四平",
		code: "220300"
	},
	{
		id: 220400,
		pid: 220000,
		name: "辽源",
		code: "220400"
	},
	{
		id: 220500,
		pid: 220000,
		name: "通化",
		code: "220500"
	},
	{
		id: 220600,
		pid: 220000,
		name: "白山",
		code: "220600"
	},
	{
		id: 220700,
		pid: 220000,
		name: "松原",
		code: "220700"
	},
	{
		id: 220800,
		pid: 220000,
		name: "白城",
		code: "220800"
	},
	{
		id: 222400,
		pid: 220000,
		name: "延边",
		code: "222400"
	},
	{
		id: 230000,
		pid: 0,
		name: "黑龙江",
		code: "230000"
	},
	{
		id: 230100,
		pid: 230000,
		name: "哈尔滨",
		code: "230100"
	},
	{
		id: 230200,
		pid: 230000,
		name: "齐齐哈尔",
		code: "230200"
	},
	{
		id: 230300,
		pid: 230000,
		name: "鸡西",
		code: "230300"
	},
	{
		id: 230400,
		pid: 230000,
		name: "鹤岗",
		code: "230400"
	},
	{
		id: 230500,
		pid: 230000,
		name: "双鸭山",
		code: "230500"
	},
	{
		id: 230600,
		pid: 230000,
		name: "大庆",
		code: "230600"
	},
	{
		id: 230700,
		pid: 230000,
		name: "伊春",
		code: "230700"
	},
	{
		id: 230800,
		pid: 230000,
		name: "佳木斯",
		code: "230800"
	},
	{
		id: 230900,
		pid: 230000,
		name: "七台河",
		code: "230900"
	},
	{
		id: 231000,
		pid: 230000,
		name: "牡丹江",
		code: "231000"
	},
	{
		id: 231100,
		pid: 230000,
		name: "黑河",
		code: "231100"
	},
	{
		id: 231200,
		pid: 230000,
		name: "绥化",
		code: "231200"
	},
	{
		id: 232700,
		pid: 230000,
		name: "大兴安岭",
		code: "232700"
	},
	{
		id: 310000,
		pid: 0,
		name: "上海",
		code: "310000"
	},
	{
		id: 310101,
		pid: 310000,
		name: "黄浦",
		code: "310101"
	},
	{
		id: 310104,
		pid: 310000,
		name: "徐汇",
		code: "310104"
	},
	{
		id: 310105,
		pid: 310000,
		name: "长宁",
		code: "310105"
	},
	{
		id: 310106,
		pid: 310000,
		name: "静安",
		code: "310106"
	},
	{
		id: 310107,
		pid: 310000,
		name: "普陀",
		code: "310107"
	},
	{
		id: 310109,
		pid: 310000,
		name: "虹口",
		code: "310109"
	},
	{
		id: 310110,
		pid: 310000,
		name: "杨浦",
		code: "310110"
	},
	{
		id: 310112,
		pid: 310000,
		name: "闵行",
		code: "310112"
	},
	{
		id: 310113,
		pid: 310000,
		name: "宝山",
		code: "310113"
	},
	{
		id: 310114,
		pid: 310000,
		name: "嘉定",
		code: "310114"
	},
	{
		id: 310115,
		pid: 310000,
		name: "浦东",
		code: "310115"
	},
	{
		id: 310116,
		pid: 310000,
		name: "金山",
		code: "310116"
	},
	{
		id: 310117,
		pid: 310000,
		name: "松江",
		code: "310117"
	},
	{
		id: 310118,
		pid: 310000,
		name: "青浦",
		code: "310118"
	},
	{
		id: 310120,
		pid: 310000,
		name: "奉贤",
		code: "310120"
	},
	{
		id: 310151,
		pid: 310000,
		name: "崇明",
		code: "310151"
	},
	{
		id: 320000,
		pid: 0,
		name: "江苏",
		code: "320000"
	},
	{
		id: 320100,
		pid: 320000,
		name: "南京",
		code: "320100"
	},
	{
		id: 320200,
		pid: 320000,
		name: "无锡",
		code: "320200"
	},
	{
		id: 320300,
		pid: 320000,
		name: "徐州",
		code: "320300"
	},
	{
		id: 320400,
		pid: 320000,
		name: "常州",
		code: "320400"
	},
	{
		id: 320500,
		pid: 320000,
		name: "苏州",
		code: "320500"
	},
	{
		id: 320600,
		pid: 320000,
		name: "南通",
		code: "320600"
	},
	{
		id: 320700,
		pid: 320000,
		name: "连云港",
		code: "320700"
	},
	{
		id: 320800,
		pid: 320000,
		name: "淮安",
		code: "320800"
	},
	{
		id: 320900,
		pid: 320000,
		name: "盐城",
		code: "320900"
	},
	{
		id: 321000,
		pid: 320000,
		name: "扬州",
		code: "321000"
	},
	{
		id: 321100,
		pid: 320000,
		name: "镇江",
		code: "321100"
	},
	{
		id: 321200,
		pid: 320000,
		name: "泰州",
		code: "321200"
	},
	{
		id: 321300,
		pid: 320000,
		name: "宿迁",
		code: "321300"
	},
	{
		id: 330000,
		pid: 0,
		name: "浙江",
		code: "330000"
	},
	{
		id: 330100,
		pid: 330000,
		name: "杭州",
		code: "330100"
	},
	{
		id: 330200,
		pid: 330000,
		name: "宁波",
		code: "330200"
	},
	{
		id: 330300,
		pid: 330000,
		name: "温州",
		code: "330300"
	},
	{
		id: 330400,
		pid: 330000,
		name: "嘉兴",
		code: "330400"
	},
	{
		id: 330500,
		pid: 330000,
		name: "湖州",
		code: "330500"
	},
	{
		id: 330600,
		pid: 330000,
		name: "绍兴",
		code: "330600"
	},
	{
		id: 330700,
		pid: 330000,
		name: "金华",
		code: "330700"
	},
	{
		id: 330800,
		pid: 330000,
		name: "衢州",
		code: "330800"
	},
	{
		id: 330900,
		pid: 330000,
		name: "舟山",
		code: "330900"
	},
	{
		id: 331000,
		pid: 330000,
		name: "台州",
		code: "331000"
	},
	{
		id: 331100,
		pid: 330000,
		name: "丽水",
		code: "331100"
	},
	{
		id: 340000,
		pid: 0,
		name: "安徽",
		code: "340000"
	},
	{
		id: 340100,
		pid: 340000,
		name: "合肥",
		code: "340100"
	},
	{
		id: 340200,
		pid: 340000,
		name: "芜湖",
		code: "340200"
	},
	{
		id: 340300,
		pid: 340000,
		name: "蚌埠",
		code: "340300"
	},
	{
		id: 340400,
		pid: 340000,
		name: "淮南",
		code: "340400"
	},
	{
		id: 340500,
		pid: 340000,
		name: "马鞍山",
		code: "340500"
	},
	{
		id: 340600,
		pid: 340000,
		name: "淮北",
		code: "340600"
	},
	{
		id: 340700,
		pid: 340000,
		name: "铜陵",
		code: "340700"
	},
	{
		id: 340800,
		pid: 340000,
		name: "安庆",
		code: "340800"
	},
	{
		id: 341000,
		pid: 340000,
		name: "黄山",
		code: "341000"
	},
	{
		id: 341100,
		pid: 340000,
		name: "滁州",
		code: "341100"
	},
	{
		id: 341200,
		pid: 340000,
		name: "阜阳",
		code: "341200"
	},
	{
		id: 341300,
		pid: 340000,
		name: "宿州",
		code: "341300"
	},
	{
		id: 341500,
		pid: 340000,
		name: "六安",
		code: "341500"
	},
	{
		id: 341600,
		pid: 340000,
		name: "亳州",
		code: "341600"
	},
	{
		id: 341700,
		pid: 340000,
		name: "池州",
		code: "341700"
	},
	{
		id: 341800,
		pid: 340000,
		name: "宣城",
		code: "341800"
	},
	{
		id: 350000,
		pid: 0,
		name: "福建",
		code: "350000"
	},
	{
		id: 350100,
		pid: 350000,
		name: "福州",
		code: "350100"
	},
	{
		id: 350200,
		pid: 350000,
		name: "厦门",
		code: "350200"
	},
	{
		id: 350300,
		pid: 350000,
		name: "莆田",
		code: "350300"
	},
	{
		id: 350400,
		pid: 350000,
		name: "三明",
		code: "350400"
	},
	{
		id: 350500,
		pid: 350000,
		name: "泉州",
		code: "350500"
	},
	{
		id: 350600,
		pid: 350000,
		name: "漳州",
		code: "350600"
	},
	{
		id: 350700,
		pid: 350000,
		name: "南平",
		code: "350700"
	},
	{
		id: 350800,
		pid: 350000,
		name: "龙岩",
		code: "350800"
	},
	{
		id: 350900,
		pid: 350000,
		name: "宁德",
		code: "350900"
	},
	{
		id: 360000,
		pid: 0,
		name: "江西",
		code: "360000"
	},
	{
		id: 360100,
		pid: 360000,
		name: "南昌",
		code: "360100"
	},
	{
		id: 360200,
		pid: 360000,
		name: "景德镇",
		code: "360200"
	},
	{
		id: 360300,
		pid: 360000,
		name: "萍乡",
		code: "360300"
	},
	{
		id: 360400,
		pid: 360000,
		name: "九江",
		code: "360400"
	},
	{
		id: 360500,
		pid: 360000,
		name: "新余",
		code: "360500"
	},
	{
		id: 360600,
		pid: 360000,
		name: "鹰潭",
		code: "360600"
	},
	{
		id: 360700,
		pid: 360000,
		name: "赣州",
		code: "360700"
	},
	{
		id: 360800,
		pid: 360000,
		name: "吉安",
		code: "360800"
	},
	{
		id: 360900,
		pid: 360000,
		name: "宜春",
		code: "360900"
	},
	{
		id: 361000,
		pid: 360000,
		name: "抚州",
		code: "361000"
	},
	{
		id: 361100,
		pid: 360000,
		name: "上饶",
		code: "361100"
	},
	{
		id: 370000,
		pid: 0,
		name: "山东",
		code: "370000"
	},
	{
		id: 370100,
		pid: 370000,
		name: "济南",
		code: "370100"
	},
	{
		id: 370200,
		pid: 370000,
		name: "青岛",
		code: "370200"
	},
	{
		id: 370300,
		pid: 370000,
		name: "淄博",
		code: "370300"
	},
	{
		id: 370400,
		pid: 370000,
		name: "枣庄",
		code: "370400"
	},
	{
		id: 370500,
		pid: 370000,
		name: "东营",
		code: "370500"
	},
	{
		id: 370600,
		pid: 370000,
		name: "烟台",
		code: "370600"
	},
	{
		id: 370700,
		pid: 370000,
		name: "潍坊",
		code: "370700"
	},
	{
		id: 370800,
		pid: 370000,
		name: "济宁",
		code: "370800"
	},
	{
		id: 370900,
		pid: 370000,
		name: "泰安",
		code: "370900"
	},
	{
		id: 371000,
		pid: 370000,
		name: "威海",
		code: "371000"
	},
	{
		id: 371100,
		pid: 370000,
		name: "日照",
		code: "371100"
	},
	{
		id: 371300,
		pid: 370000,
		name: "临沂",
		code: "371300"
	},
	{
		id: 371400,
		pid: 370000,
		name: "德州",
		code: "371400"
	},
	{
		id: 371500,
		pid: 370000,
		name: "聊城",
		code: "371500"
	},
	{
		id: 371600,
		pid: 370000,
		name: "滨州",
		code: "371600"
	},
	{
		id: 371700,
		pid: 370000,
		name: "菏泽",
		code: "371700"
	},
	{
		id: 410000,
		pid: 0,
		name: "河南",
		code: "410000"
	},
	{
		id: 410100,
		pid: 410000,
		name: "郑州",
		code: "410100"
	},
	{
		id: 410200,
		pid: 410000,
		name: "���封",
		code: "410200"
	},
	{
		id: 410300,
		pid: 410000,
		name: "洛阳",
		code: "410300"
	},
	{
		id: 410400,
		pid: 410000,
		name: "平顶山",
		code: "410400"
	},
	{
		id: 410500,
		pid: 410000,
		name: "安阳",
		code: "410500"
	},
	{
		id: 410600,
		pid: 410000,
		name: "鹤壁",
		code: "410600"
	},
	{
		id: 410700,
		pid: 410000,
		name: "新乡",
		code: "410700"
	},
	{
		id: 410800,
		pid: 410000,
		name: "焦作",
		code: "410800"
	},
	{
		id: 410900,
		pid: 410000,
		name: "濮阳",
		code: "410900"
	},
	{
		id: 411000,
		pid: 410000,
		name: "许昌",
		code: "411000"
	},
	{
		id: 411100,
		pid: 410000,
		name: "漯河",
		code: "411100"
	},
	{
		id: 411200,
		pid: 410000,
		name: "三门峡",
		code: "411200"
	},
	{
		id: 411300,
		pid: 410000,
		name: "南阳",
		code: "411300"
	},
	{
		id: 411400,
		pid: 410000,
		name: "商丘",
		code: "411400"
	},
	{
		id: 411500,
		pid: 410000,
		name: "信阳",
		code: "411500"
	},
	{
		id: 411600,
		pid: 410000,
		name: "周口",
		code: "411600"
	},
	{
		id: 411700,
		pid: 410000,
		name: "驻马店",
		code: "411700"
	},
	{
		id: 419001,
		pid: 410000,
		name: "济源",
		code: "419001"
	},
	{
		id: 420000,
		pid: 0,
		name: "湖北",
		code: "420000"
	},
	{
		id: 420100,
		pid: 420000,
		name: "武汉",
		code: "420100"
	},
	{
		id: 420200,
		pid: 420000,
		name: "黄石",
		code: "420200"
	},
	{
		id: 420300,
		pid: 420000,
		name: "十堰",
		code: "420300"
	},
	{
		id: 420500,
		pid: 420000,
		name: "宜昌",
		code: "420500"
	},
	{
		id: 420600,
		pid: 420000,
		name: "襄阳",
		code: "420600"
	},
	{
		id: 420700,
		pid: 420000,
		name: "鄂州",
		code: "420700"
	},
	{
		id: 420800,
		pid: 420000,
		name: "荆门",
		code: "420800"
	},
	{
		id: 420900,
		pid: 420000,
		name: "孝感",
		code: "420900"
	},
	{
		id: 421000,
		pid: 420000,
		name: "荆州",
		code: "421000"
	},
	{
		id: 421100,
		pid: 420000,
		name: "黄冈",
		code: "421100"
	},
	{
		id: 421200,
		pid: 420000,
		name: "咸宁",
		code: "421200"
	},
	{
		id: 421300,
		pid: 420000,
		name: "随州",
		code: "421300"
	},
	{
		id: 422800,
		pid: 420000,
		name: "恩施",
		code: "422800"
	},
	{
		id: 429004,
		pid: 420000,
		name: "仙桃",
		code: "429004"
	},
	{
		id: 429005,
		pid: 420000,
		name: "潜江",
		code: "429005"
	},
	{
		id: 429006,
		pid: 420000,
		name: "天门",
		code: "429006"
	},
	{
		id: 429021,
		pid: 420000,
		name: "神农架",
		code: "429021"
	},
	{
		id: 430000,
		pid: 0,
		name: "湖南",
		code: "430000"
	},
	{
		id: 430100,
		pid: 430000,
		name: "长沙",
		code: "430100"
	},
	{
		id: 430200,
		pid: 430000,
		name: "株洲",
		code: "430200"
	},
	{
		id: 430300,
		pid: 430000,
		name: "湘潭",
		code: "430300"
	},
	{
		id: 430400,
		pid: 430000,
		name: "衡阳",
		code: "430400"
	},
	{
		id: 430500,
		pid: 430000,
		name: "邵阳",
		code: "430500"
	},
	{
		id: 430600,
		pid: 430000,
		name: "岳阳",
		code: "430600"
	},
	{
		id: 430700,
		pid: 430000,
		name: "常德",
		code: "430700"
	},
	{
		id: 430800,
		pid: 430000,
		name: "张家界",
		code: "430800"
	},
	{
		id: 430900,
		pid: 430000,
		name: "益阳",
		code: "430900"
	},
	{
		id: 431000,
		pid: 430000,
		name: "郴州",
		code: "431000"
	},
	{
		id: 431100,
		pid: 430000,
		name: "永州",
		code: "431100"
	},
	{
		id: 431200,
		pid: 430000,
		name: "怀化",
		code: "431200"
	},
	{
		id: 431300,
		pid: 430000,
		name: "娄底",
		code: "431300"
	},
	{
		id: 433100,
		pid: 430000,
		name: "湘西",
		code: "433100"
	},
	{
		id: 440000,
		pid: 430000,
		name: "广东",
		code: "440000"
	},
	{
		id: 440100,
		pid: 0,
		name: "广州",
		code: "440100"
	},
	{
		id: 440200,
		pid: 440100,
		name: "韶关",
		code: "440200"
	},
	{
		id: 440300,
		pid: 440100,
		name: "深圳",
		code: "440300"
	},
	{
		id: 440400,
		pid: 440100,
		name: "珠海",
		code: "440400"
	},
	{
		id: 440500,
		pid: 440100,
		name: "汕头",
		code: "440500"
	},
	{
		id: 440600,
		pid: 440100,
		name: "佛山",
		code: "440600"
	},
	{
		id: 440700,
		pid: 440100,
		name: "江门",
		code: "440700"
	},
	{
		id: 440800,
		pid: 440100,
		name: "湛江",
		code: "440800"
	},
	{
		id: 440900,
		pid: 440100,
		name: "茂名",
		code: "440900"
	},
	{
		id: 441200,
		pid: 440100,
		name: "肇庆",
		code: "441200"
	},
	{
		id: 441300,
		pid: 440100,
		name: "惠州",
		code: "441300"
	},
	{
		id: 441400,
		pid: 440100,
		name: "梅州",
		code: "441400"
	},
	{
		id: 441500,
		pid: 440100,
		name: "汕尾",
		code: "441500"
	},
	{
		id: 441600,
		pid: 440100,
		name: "河源",
		code: "441600"
	},
	{
		id: 441700,
		pid: 440100,
		name: "阳江",
		code: "441700"
	},
	{
		id: 441800,
		pid: 440100,
		name: "清远",
		code: "441800"
	},
	{
		id: 441900,
		pid: 440100,
		name: "东莞",
		code: "441900"
	},
	{
		id: 442000,
		pid: 440100,
		name: "中山",
		code: "442000"
	},
	{
		id: 445100,
		pid: 440100,
		name: "潮州",
		code: "445100"
	},
	{
		id: 445200,
		pid: 440100,
		name: "揭阳",
		code: "445200"
	},
	{
		id: 445300,
		pid: 440100,
		name: "云浮",
		code: "445300"
	},
	{
		id: 450000,
		pid: 0,
		name: "广西",
		code: "450000"
	},
	{
		id: 450100,
		pid: 450000,
		name: "南宁",
		code: "450100"
	},
	{
		id: 450200,
		pid: 450000,
		name: "柳州",
		code: "450200"
	},
	{
		id: 450300,
		pid: 450000,
		name: "桂林",
		code: "450300"
	},
	{
		id: 450400,
		pid: 450000,
		name: "梧州",
		code: "450400"
	},
	{
		id: 450500,
		pid: 450000,
		name: "北海",
		code: "450500"
	},
	{
		id: 450600,
		pid: 450000,
		name: "防城港",
		code: "450600"
	},
	{
		id: 450700,
		pid: 450000,
		name: "钦州",
		code: "450700"
	},
	{
		id: 450800,
		pid: 450000,
		name: "贵港",
		code: "450800"
	},
	{
		id: 450900,
		pid: 450000,
		name: "玉林",
		code: "450900"
	},
	{
		id: 451000,
		pid: 450000,
		name: "百色",
		code: "451000"
	},
	{
		id: 451100,
		pid: 450000,
		name: "贺州",
		code: "451100"
	},
	{
		id: 451200,
		pid: 450000,
		name: "河池",
		code: "451200"
	},
	{
		id: 451300,
		pid: 450000,
		name: "来宾",
		code: "451300"
	},
	{
		id: 451400,
		pid: 450000,
		name: "崇左",
		code: "451400"
	},
	{
		id: 460000,
		pid: 0,
		name: "海南",
		code: "460000"
	},
	{
		id: 460100,
		pid: 460000,
		name: "海口",
		code: "460100"
	},
	{
		id: 460200,
		pid: 460000,
		name: "三亚",
		code: "460200"
	},
	{
		id: 460300,
		pid: 460000,
		name: "三沙",
		code: "460300"
	},
	{
		id: 460400,
		pid: 460000,
		name: "儋州",
		code: "460400"
	},
	{
		id: 469001,
		pid: 460000,
		name: "五指山",
		code: "469001"
	},
	{
		id: 469002,
		pid: 460000,
		name: "琼海",
		code: "469002"
	},
	{
		id: 469005,
		pid: 460000,
		name: "文昌",
		code: "469005"
	},
	{
		id: 469006,
		pid: 460000,
		name: "万宁",
		code: "469006"
	},
	{
		id: 469007,
		pid: 460000,
		name: "东方",
		code: "469007"
	},
	{
		id: 469021,
		pid: 460000,
		name: "定安",
		code: "469021"
	},
	{
		id: 469022,
		pid: 460000,
		name: "屯昌",
		code: "469022"
	},
	{
		id: 469023,
		pid: 460000,
		name: "澄迈",
		code: "469023"
	},
	{
		id: 469024,
		pid: 460000,
		name: "临高",
		code: "469024"
	},
	{
		id: 469025,
		pid: 460000,
		name: "白沙",
		code: "469025"
	},
	{
		id: 469026,
		pid: 460000,
		name: "昌江",
		code: "469026"
	},
	{
		id: 469027,
		pid: 460000,
		name: "乐东",
		code: "469027"
	},
	{
		id: 469028,
		pid: 460000,
		name: "陵水",
		code: "469028"
	},
	{
		id: 469029,
		pid: 460000,
		name: "保亭",
		code: "469029"
	},
	{
		id: 469030,
		pid: 460000,
		name: "琼中",
		code: "469030"
	},
	{
		id: 500000,
		pid: 0,
		name: "重庆",
		code: "500000"
	},
	{
		id: 500101,
		pid: 500000,
		name: "万州",
		code: "500101"
	},
	{
		id: 500102,
		pid: 500000,
		name: "涪陵",
		code: "500102"
	},
	{
		id: 500103,
		pid: 500000,
		name: "渝中",
		code: "500103"
	},
	{
		id: 500104,
		pid: 500000,
		name: "大渡口",
		code: "500104"
	},
	{
		id: 500105,
		pid: 500000,
		name: "江北",
		code: "500105"
	},
	{
		id: 500106,
		pid: 500000,
		name: "沙坪坝",
		code: "500106"
	},
	{
		id: 500107,
		pid: 500000,
		name: "九龙坡",
		code: "500107"
	},
	{
		id: 500108,
		pid: 500000,
		name: "南岸",
		code: "500108"
	},
	{
		id: 500109,
		pid: 500000,
		name: "北碚",
		code: "500109"
	},
	{
		id: 500110,
		pid: 500000,
		name: "綦江",
		code: "500110"
	},
	{
		id: 500111,
		pid: 500000,
		name: "大足",
		code: "500111"
	},
	{
		id: 500112,
		pid: 500000,
		name: "渝北",
		code: "500112"
	},
	{
		id: 500113,
		pid: 500000,
		name: "巴南",
		code: "500113"
	},
	{
		id: 500114,
		pid: 500000,
		name: "黔江",
		code: "500114"
	},
	{
		id: 500115,
		pid: 500000,
		name: "长寿",
		code: "500115"
	},
	{
		id: 500116,
		pid: 500000,
		name: "江津",
		code: "500116"
	},
	{
		id: 500117,
		pid: 500000,
		name: "合川",
		code: "500117"
	},
	{
		id: 500118,
		pid: 500000,
		name: "永川",
		code: "500118"
	},
	{
		id: 500119,
		pid: 500000,
		name: "南川",
		code: "500119"
	},
	{
		id: 500120,
		pid: 500000,
		name: "璧山",
		code: "500120"
	},
	{
		id: 500151,
		pid: 500000,
		name: "铜梁",
		code: "500151"
	},
	{
		id: 500152,
		pid: 500000,
		name: "潼南",
		code: "500152"
	},
	{
		id: 500153,
		pid: 500000,
		name: "荣昌",
		code: "500153"
	},
	{
		id: 500154,
		pid: 500000,
		name: "开州",
		code: "500154"
	},
	{
		id: 500155,
		pid: 500000,
		name: "梁平",
		code: "500155"
	},
	{
		id: 500156,
		pid: 500000,
		name: "武隆",
		code: "500156"
	},
	{
		id: 500229,
		pid: 500000,
		name: "城口",
		code: "500229"
	},
	{
		id: 500230,
		pid: 500000,
		name: "丰都",
		code: "500230"
	},
	{
		id: 500231,
		pid: 500000,
		name: "垫江",
		code: "500231"
	},
	{
		id: 500233,
		pid: 500000,
		name: "忠县",
		code: "500233"
	},
	{
		id: 500235,
		pid: 500000,
		name: "云阳",
		code: "500235"
	},
	{
		id: 500236,
		pid: 500000,
		name: "奉节",
		code: "500236"
	},
	{
		id: 500237,
		pid: 500000,
		name: "巫山",
		code: "500237"
	},
	{
		id: 500238,
		pid: 500000,
		name: "巫溪",
		code: "500238"
	},
	{
		id: 500240,
		pid: 500000,
		name: "石柱",
		code: "500240"
	},
	{
		id: 500241,
		pid: 500000,
		name: "秀山",
		code: "500241"
	},
	{
		id: 500242,
		pid: 500000,
		name: "酉阳",
		code: "500242"
	},
	{
		id: 500243,
		pid: 500000,
		name: "彭水",
		code: "500243"
	},
	{
		id: 510000,
		pid: 0,
		name: "四川",
		code: "510000"
	},
	{
		id: 510100,
		pid: 510000,
		name: "成都",
		code: "510100"
	},
	{
		id: 510300,
		pid: 510000,
		name: "自贡",
		code: "510300"
	},
	{
		id: 510400,
		pid: 510000,
		name: "攀枝花",
		code: "510400"
	},
	{
		id: 510500,
		pid: 510000,
		name: "泸州",
		code: "510500"
	},
	{
		id: 510600,
		pid: 510000,
		name: "德阳",
		code: "510600"
	},
	{
		id: 510700,
		pid: 510000,
		name: "绵阳",
		code: "510700"
	},
	{
		id: 510800,
		pid: 510000,
		name: "广元",
		code: "510800"
	},
	{
		id: 510900,
		pid: 510000,
		name: "遂宁",
		code: "510900"
	},
	{
		id: 511000,
		pid: 510000,
		name: "内江",
		code: "511000"
	},
	{
		id: 511100,
		pid: 510000,
		name: "乐山",
		code: "511100"
	},
	{
		id: 511300,
		pid: 510000,
		name: "南充",
		code: "511300"
	},
	{
		id: 511400,
		pid: 510000,
		name: "眉山",
		code: "511400"
	},
	{
		id: 511500,
		pid: 510000,
		name: "宜宾",
		code: "511500"
	},
	{
		id: 511600,
		pid: 510000,
		name: "广安",
		code: "511600"
	},
	{
		id: 511700,
		pid: 510000,
		name: "达州",
		code: "511700"
	},
	{
		id: 511800,
		pid: 510000,
		name: "雅安",
		code: "511800"
	},
	{
		id: 511900,
		pid: 510000,
		name: "巴中",
		code: "511900"
	},
	{
		id: 512000,
		pid: 510000,
		name: "资阳",
		code: "512000"
	},
	{
		id: 513200,
		pid: 510000,
		name: "阿坝",
		code: "513200"
	},
	{
		id: 513300,
		pid: 510000,
		name: "甘孜",
		code: "513300"
	},
	{
		id: 513400,
		pid: 510000,
		name: "凉山",
		code: "513400"
	},
	{
		id: 520000,
		pid: 0,
		name: "贵州",
		code: "520000"
	},
	{
		id: 520100,
		pid: 520000,
		name: "贵阳",
		code: "520100"
	},
	{
		id: 520200,
		pid: 520000,
		name: "六盘水",
		code: "520200"
	},
	{
		id: 520300,
		pid: 520000,
		name: "遵义",
		code: "520300"
	},
	{
		id: 520400,
		pid: 520000,
		name: "安顺",
		code: "520400"
	},
	{
		id: 520500,
		pid: 520000,
		name: "毕节",
		code: "520500"
	},
	{
		id: 520600,
		pid: 520000,
		name: "铜仁",
		code: "520600"
	},
	{
		id: 522300,
		pid: 520000,
		name: "黔西南",
		code: "522300"
	},
	{
		id: 522600,
		pid: 520000,
		name: "黔东南",
		code: "522600"
	},
	{
		id: 522700,
		pid: 520000,
		name: "黔南布",
		code: "522700"
	},
	{
		id: 530000,
		pid: 0,
		name: "云南",
		code: "530000"
	},
	{
		id: 530100,
		pid: 530000,
		name: "昆明",
		code: "530100"
	},
	{
		id: 530300,
		pid: 530000,
		name: "曲靖",
		code: "530300"
	},
	{
		id: 530400,
		pid: 530000,
		name: "玉溪",
		code: "530400"
	},
	{
		id: 530500,
		pid: 530000,
		name: "保山",
		code: "530500"
	},
	{
		id: 530600,
		pid: 530000,
		name: "昭通",
		code: "530600"
	},
	{
		id: 530700,
		pid: 530000,
		name: "丽江",
		code: "530700"
	},
	{
		id: 530800,
		pid: 530000,
		name: "普洱",
		code: "530800"
	},
	{
		id: 530900,
		pid: 530000,
		name: "临沧",
		code: "530900"
	},
	{
		id: 532300,
		pid: 530000,
		name: "楚雄",
		code: "532300"
	},
	{
		id: 532500,
		pid: 530000,
		name: "红河",
		code: "532500"
	},
	{
		id: 532600,
		pid: 530000,
		name: "文山",
		code: "532600"
	},
	{
		id: 532800,
		pid: 530000,
		name: "西双版纳",
		code: "532800"
	},
	{
		id: 532900,
		pid: 530000,
		name: "大理",
		code: "532900"
	},
	{
		id: 533100,
		pid: 530000,
		name: "德宏",
		code: "533100"
	},
	{
		id: 533300,
		pid: 530000,
		name: "怒江",
		code: "533300"
	},
	{
		id: 533400,
		pid: 530000,
		name: "迪庆",
		code: "533400"
	},
	{
		id: 540000,
		pid: 0,
		name: "西藏",
		code: "540000"
	},
	{
		id: 540100,
		pid: 540000,
		name: "拉萨",
		code: "540100"
	},
	{
		id: 540200,
		pid: 540000,
		name: "日喀则",
		code: "540200"
	},
	{
		id: 540300,
		pid: 540000,
		name: "昌都",
		code: "540300"
	},
	{
		id: 540400,
		pid: 540000,
		name: "林芝",
		code: "540400"
	},
	{
		id: 540500,
		pid: 540000,
		name: "山南",
		code: "540500"
	},
	{
		id: 540600,
		pid: 540000,
		name: "那曲",
		code: "540600"
	},
	{
		id: 542500,
		pid: 540000,
		name: "阿里",
		code: "542500"
	},
	{
		id: 610000,
		pid: 0,
		name: "陕西",
		code: "610000"
	},
	{
		id: 610100,
		pid: 610000,
		name: "西安",
		code: "610100"
	},
	{
		id: 610200,
		pid: 610000,
		name: "铜川",
		code: "610200"
	},
	{
		id: 610300,
		pid: 610000,
		name: "宝鸡",
		code: "610300"
	},
	{
		id: 610400,
		pid: 610000,
		name: "咸阳",
		code: "610400"
	},
	{
		id: 610500,
		pid: 610000,
		name: "渭南",
		code: "610500"
	},
	{
		id: 610600,
		pid: 610000,
		name: "延安",
		code: "610600"
	},
	{
		id: 610700,
		pid: 610000,
		name: "汉中",
		code: "610700"
	},
	{
		id: 610800,
		pid: 610000,
		name: "榆林",
		code: "610800"
	},
	{
		id: 610900,
		pid: 610000,
		name: "安康",
		code: "610900"
	},
	{
		id: 611000,
		pid: 610000,
		name: "商洛",
		code: "611000"
	},
	{
		id: 620000,
		pid: 0,
		name: "甘肃",
		code: "620000"
	},
	{
		id: 620100,
		pid: 620000,
		name: "兰州",
		code: "620100"
	},
	{
		id: 620200,
		pid: 620000,
		name: "嘉峪关",
		code: "620200"
	},
	{
		id: 620300,
		pid: 620000,
		name: "金昌",
		code: "620300"
	},
	{
		id: 620400,
		pid: 620000,
		name: "白银",
		code: "620400"
	},
	{
		id: 620500,
		pid: 620000,
		name: "天水",
		code: "620500"
	},
	{
		id: 620600,
		pid: 620000,
		name: "武威",
		code: "620600"
	},
	{
		id: 620700,
		pid: 620000,
		name: "张掖",
		code: "620700"
	},
	{
		id: 620800,
		pid: 620000,
		name: "平凉",
		code: "620800"
	},
	{
		id: 620900,
		pid: 620000,
		name: "酒泉",
		code: "620900"
	},
	{
		id: 621000,
		pid: 620000,
		name: "庆阳",
		code: "621000"
	},
	{
		id: 621100,
		pid: 620000,
		name: "定西",
		code: "621100"
	},
	{
		id: 621200,
		pid: 620000,
		name: "陇南",
		code: "621200"
	},
	{
		id: 622900,
		pid: 620000,
		name: "临夏",
		code: "622900"
	},
	{
		id: 623000,
		pid: 620000,
		name: "甘南",
		code: "623000"
	},
	{
		id: 630000,
		pid: 0,
		name: "青海",
		code: "630000"
	},
	{
		id: 630100,
		pid: 630000,
		name: "西宁",
		code: "630100"
	},
	{
		id: 630200,
		pid: 630000,
		name: "海东",
		code: "630200"
	},
	{
		id: 632200,
		pid: 630000,
		name: "海北",
		code: "632200"
	},
	{
		id: 632300,
		pid: 630000,
		name: "黄南",
		code: "632300"
	},
	{
		id: 632500,
		pid: 630000,
		name: "海南",
		code: "632500"
	},
	{
		id: 632600,
		pid: 630000,
		name: "果洛",
		code: "632600"
	},
	{
		id: 632700,
		pid: 630000,
		name: "玉树",
		code: "632700"
	},
	{
		id: 632800,
		pid: 630000,
		name: "海西",
		code: "632800"
	},
	{
		id: 640000,
		pid: 0,
		name: "宁夏",
		code: "640000"
	},
	{
		id: 640100,
		pid: 640000,
		name: "银川",
		code: "640100"
	},
	{
		id: 640200,
		pid: 640000,
		name: "石嘴山",
		code: "640200"
	},
	{
		id: 640300,
		pid: 640000,
		name: "吴忠",
		code: "640300"
	},
	{
		id: 640400,
		pid: 640000,
		name: "固原",
		code: "640400"
	},
	{
		id: 640500,
		pid: 640000,
		name: "中卫",
		code: "640500"
	},
	{
		id: 650000,
		pid: 0,
		name: "新疆",
		code: "650000"
	},
	{
		id: 650100,
		pid: 650000,
		name: "乌鲁木齐",
		code: "650100"
	},
	{
		id: 650200,
		pid: 650000,
		name: "克拉玛依",
		code: "650200"
	},
	{
		id: 650400,
		pid: 650000,
		name: "吐鲁番",
		code: "650400"
	},
	{
		id: 650500,
		pid: 650000,
		name: "哈密",
		code: "650500"
	},
	{
		id: 652300,
		pid: 650000,
		name: "昌吉",
		code: "652300"
	},
	{
		id: 652700,
		pid: 650000,
		name: "博尔塔拉",
		code: "652700"
	},
	{
		id: 652800,
		pid: 650000,
		name: "巴音郭楞",
		code: "652800"
	},
	{
		id: 652900,
		pid: 650000,
		name: "阿克苏",
		code: "652900"
	},
	{
		id: 653000,
		pid: 650000,
		name: "克孜勒苏",
		code: "653000"
	},
	{
		id: 653100,
		pid: 650000,
		name: "喀什",
		code: "653100"
	},
	{
		id: 653200,
		pid: 650000,
		name: "和田",
		code: "653200"
	},
	{
		id: 654000,
		pid: 650000,
		name: "伊犁",
		code: "654000"
	},
	{
		id: 654200,
		pid: 650000,
		name: "塔城",
		code: "654200"
	},
	{
		id: 654300,
		pid: 650000,
		name: "阿勒泰",
		code: "654300"
	},
	{
		id: 659001,
		pid: 650000,
		name: "石河子",
		code: "659001"
	},
	{
		id: 659002,
		pid: 650000,
		name: "阿拉尔",
		code: "659002"
	},
	{
		id: 659003,
		pid: 650000,
		name: "图木舒克",
		code: "659003"
	},
	{
		id: 659004,
		pid: 650000,
		name: "五家渠",
		code: "659004"
	},
	{
		id: 659005,
		pid: 650000,
		name: "北屯",
		code: "659005"
	},
	{
		id: 659006,
		pid: 650000,
		name: "铁门关",
		code: "659006"
	},
	{
		id: 659007,
		pid: 650000,
		name: "双河",
		code: "659007"
	},
	{
		id: 659008,
		pid: 650000,
		name: "可克达拉",
		code: "659008"
	},
	{
		id: 659009,
		pid: 650000,
		name: "昆玉",
		code: "659009"
	},
	{
		id: 659010,
		pid: 650000,
		name: "胡杨河",
		code: "659010"
	},
	{
		id: 659011,
		pid: 650000,
		name: "新星",
		code: "659011"
	},
	{
		id: 659012,
		pid: 650000,
		name: "白杨",
		code: "659012"
	}
]